Revit 2026 API

# SchemaCommonHidden Property

---

The property labeled "Hidden" common to all visual Asset types.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string Hidden { get; }
```
```vb
Public Shared ReadOnly Property Hidden As String
	Get
```
```cpp
public:
static property String^ Hidden {
	String^ get ();
}
```
```fsharp
static member Hidden : string with get
```

#### Property Value

String

This property is of type "AssetPropertyBoolean".

#### Reference

SchemaCommon Class

Autodesk.Revit.DB.Visual Namespace